{"id":9,"date":"2022-03-09T01:38:01","date_gmt":"2022-03-09T01:38:01","guid":{"rendered":"https:\/\/liftupthepastor.com\/?page_id=9"},"modified":"2023-06-28T08:05:05","modified_gmt":"2023-06-28T12:05:05","slug":"lift-up-the-pastor","status":"publish","type":"page","link":"https:\/\/liftupthepastor.com\/","title":{"rendered":""},"content":{"rendered":"\n<h4 class=\"wp-block-heading\">A Pastor Can Feel So Lonely&#8230;<\/h4>\n\n\n<div class=\"wp-block-image is-style-default\">\n<figure class=\"alignleft size-medium\"><img loading=\"lazy\" decoding=\"async\" width=\"200\" height=\"300\" src=\"https:\/\/liftupthepastor.com\/wp-content\/uploads\/2022\/03\/Picture-of-Me-07.28.19-4th-Crop-200x300.jpg\" alt=\"\" class=\"wp-image-38\" srcset=\"https:\/\/liftupthepastor.com\/wp-content\/uploads\/2022\/03\/Picture-of-Me-07.28.19-4th-Crop-200x300.jpg 200w, https:\/\/liftupthepastor.com\/wp-content\/uploads\/2022\/03\/Picture-of-Me-07.28.19-4th-Crop-683x1024.jpg 683w, https:\/\/liftupthepastor.com\/wp-content\/uploads\/2022\/03\/Picture-of-Me-07.28.19-4th-Crop-768x1152.jpg 768w, https:\/\/liftupthepastor.com\/wp-content\/uploads\/2022\/03\/Picture-of-Me-07.28.19-4th-Crop-1024x1536.jpg 1024w, https:\/\/liftupthepastor.com\/wp-content\/uploads\/2022\/03\/Picture-of-Me-07.28.19-4th-Crop-1365x2048.jpg 1365w, https:\/\/liftupthepastor.com\/wp-content\/uploads\/2022\/03\/Picture-of-Me-07.28.19-4th-Crop-scaled.jpg 1706w\" sizes=\"auto, (max-width: 200px) 100vw, 200px\" \/><figcaption class=\"wp-element-caption\">Rick Standard<\/figcaption><\/figure>\n<\/div>\n\n\n<p>I know. I&#8217;ve been in the ministry for fifty years—pastoring churches most of that time. I know what it feels like to be emotionally and spiritually drained and to need some time away to get recharged.<\/p>\n\n\n\n<p>I retired from full-time pastoral ministry in December, 2020.  The last church I served was Briarwood Baptist Church in Watkinsville, Georgia.  I feel the Lord has led me to offer a unique ministry &#8212; a sabbatical ministry for pastors and churches.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<h4 class=\"wp-block-heading\">It&#8217;s Likely Your Pastor Needs A Break!<\/h4>\n\n\n\n<p>Have you thought about offering him a sabbatical?  Sabbaticals aren&#8217;t just for pastors of large churches.&nbsp; Any pastor who has served a church for five years or more probably needs some time away to refresh his soul and renew his vision.&nbsp; The Covid-19 pandemic has been an especially stressful time for pastors. <\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Let Me Come Preach In His Place At No Cost To Your Church<\/h4>\n\n\n\n<p>If your church is located in North Georgia (generally 1-2 hours driving distance from Athens or Rome), I would be glad to come and preach between two and five Sundays.  This offer is good no matter what size your church may be.&nbsp; (Bi-vocational pastors need this as much as anyone!)&nbsp; I believe giving your pastor a sabbatical will benefit your church as well.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Most Church Members Don’t Think About The Load Their Pastor Carries<\/h4>\n\n\n\n<p>Consider this:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Your pastor knows about so many hurting people and does his best to minister to them. Because of that, 8 out of 10 pastors say they feel on call 24 hours a day.<\/li>\n\n\n\n<li>Your pastor knows about many problems people are having where there are no easy answers—as much as he would like to “fix it” for them. Those problems often weigh heavy on his mind.<\/li>\n\n\n\n<li>He is responsible for preparing to preach or teach several times every week and come up with something fresh and applicable. Fifty-four per cent of pastors say their job is frequently overwhelming.<\/li>\n\n\n\n<li>He deals with criticism from a number of people who are quick to give it. Even when there is much to be positive about, the negative comments tend to loom larger in his mind.<\/li>\n\n\n\n<li>He often feels isolated. Other than with his wife, pastors tend to not share their hurts and struggles with others. He tries to be careful to not tell his wife too much and overburden her. One out of every three admit that they feel isolated as a pastor.<\/li>\n\n\n\n<li>Fifteen per cent of pastors feel that they do not have a day of rest at least once per week.<\/li>\n\n\n\n<li>More than 1 in 3 pastors say that ministry demands keep them from spending needed time with their family.<\/li>\n<\/ul>\n\n\n\n<p>[Source: 2015 Pastor Protection Research Study by LifeWay &amp; NAMB]<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">You May Think, “Well, he gets vacation time away from the church.”<\/h4>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Did you know that many pastors often don’t take all the vacation they are allowed? They feel too responsible to be gone for very long.<\/li>\n\n\n\n<li>It is not uncommon for a pastor’s vacation to be cut short because of a death or tragedy that happens back home and he has to change his plans to travel back and minister during that time.<\/li>\n\n\n\n<li>Most pastors only take a week at a time (even when they are allowed more), which is not enough time to really “unwind” and get your soul refreshed.<\/li>\n<\/ul>\n\n\n\n<h4 class=\"wp-block-heading\">I Am Glad To Come Fill The Pulpit For Him For Several Sundays In A Row If:<\/h4>\n\n\n\n<ul class=\"wp-block-list\">\n<li>The church will give him a sabbatical which is&nbsp;not counted&nbsp;as vacation time. (He is still able to keep and later use the vacation days the church has allotted him).<\/li>\n\n\n\n<li>The sabbatical is at least two weeks and two Sundays (up to four weeks and four or five Sundays is negotiable).<\/li>\n<\/ul>\n\n\n\n<h4 class=\"wp-block-heading\">Likely Benefits To Be Gained:<\/h4>\n\n\n\n<ul class=\"wp-block-list\">\n<li>The pastor’s vision for the church and the community will be renewed.<\/li>\n\n\n\n<li>He will come back with a new zeal for preaching and pastoring.<\/li>\n\n\n\n<li>The church will grow in its appreciation for its pastor and greater unity will be experienced.<\/li>\n\n\n\n<li>His marriage and family life will be strengthened.<\/li>\n<\/ul>\n\n\n\n<h4 class=\"wp-block-heading\">What Does One Do On A Sabbatical?<\/h4>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Your pastor may choose to study, pray, do sermon planning or plan church events and emphases for the coming year. He may visit with other churches to gather ideas. He may meet with other pastors to “pick their brains.” (These are things he usually doesn’t have time for).<\/li>\n\n\n\n<li>He may simply rest and recreate with his family.<\/li>\n\n\n\n<li>He may do all of these…<\/li>\n<\/ul>\n\n\n\n<h4 class=\"wp-block-heading\">Next Steps:<\/h4>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Talk to your pastor and a few other influential church leaders about this idea.<\/li>\n\n\n\n<li>Ask your pastor how soon he could work something like this into his schedule (that works well for him and his family).<\/li>\n\n\n\n<li>Feel free to check with my <a href=\"https:\/\/liftupthepastor.com\/references\/\">references<\/a>.  I can also provide the names of churches where I have done this.<\/li>\n\n\n\n<li>Wondering about my preaching style?  Here&#8217;s a sermon I preached entitled <a href=\"https:\/\/www.youtube.com\/watch?v=Px7nOwa0tQM\" data-type=\"URL\" data-id=\"https:\/\/www.youtube.com\/watch?v=Px7nOwa0tQM\" target=\"_blank\" rel=\"noreferrer noopener\">&#8220;Lift Up the Pastor&#8221;<\/a> <\/li>\n\n\n\n<li>LOOK at my <a rel=\"noreferrer noopener\" href=\"https:\/\/calendly.com\/liftupthepastor\" target=\"_blank\">schedule<\/a> for a time when I am available and that works well for your church and your pastor.  Then, <a href=\"https:\/\/liftupthepastor.com\/contact\/\">contact me <\/a> to confirm those dates or if you have any questions.  (Booking the dates on the website calendar WILL NOT automatically hold those dates for you).<\/li>\n\n\n\n<li>Remember, there is no charge to the church for this. Your church may choose to help with travel expenses, but I don’t want finances to get in the way of the church offering this time away to their pastor. As a former Director of Missions (Associational Missionary) myself, I carry a burden for pastors and their families and want to help them and the church they serve.<\/li>\n\n\n\n<li>Offering a sabbatical to your pastor may be the very best gift you could give him and his family.&nbsp; I believe it will be an investment in his ministry and serve to help him feel encouraged and appreciated.<\/li>\n<\/ul>\n\n\n\n<p>Note to Pastors:  Let me know if you would like for me to send a letter to your Deacon Chairman or the Chairperson of the Personnel Committee to get them this information if you feel hesitant to do so.<\/p>\n\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>A Pastor Can Feel So Lonely&#8230; I know. I&#8217;ve been in the ministry for fifty years—pastoring churches most of that<\/p>\n<p><a href=\"https:\/\/liftupthepastor.com\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"><\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"templates\/full-width-page.php","meta":{"footnotes":""},"class_list":["post-9","page","type-page","status-publish","hentry"],"_links":{"self":[{"href":"https:\/\/liftupthepastor.com\/wp-json\/wp\/v2\/pages\/9","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/liftupthepastor.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/liftupthepastor.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/liftupthepastor.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/liftupthepastor.com\/wp-json\/wp\/v2\/comments?post=9"}],"version-history":[{"count":51,"href":"https:\/\/liftupthepastor.com\/wp-json\/wp\/v2\/pages\/9\/revisions"}],"predecessor-version":[{"id":208,"href":"https:\/\/liftupthepastor.com\/wp-json\/wp\/v2\/pages\/9\/revisions\/208"}],"wp:attachment":[{"href":"https:\/\/liftupthepastor.com\/wp-json\/wp\/v2\/media?parent=9"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}